Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.0.17/atdf/PIC32CX1025SG60128.atdf
        <module name="MCLK" id="U2408" version="1.0.0">
          <instance name="MCLK">
            <register-group name="MCLK" name-in-module="MCLK" address-space="base" offset="0x40000800"/>
            <parameters>
              <param name="SYSTEM_CLOCK" value="48000000" caption="System Clock Frequency at Reset"/>
              <param name="INSTANCE_ID" value="2" caption="Instance index for MCLK"/>
            </parameters>
            <clock-groups>
              <clock-group name="AHB" grouporder="0">
                <clock name="HPB0" bit="0"/>
                <clock name="HPB1" bit="1"/>
                <clock name="HPB2" bit="2"/>
                <clock name="HPB3" bit="3"/>
                <clock name="DSU" bit="4"/>
                <clock name="HMATRIX" bit="5"/>
                <clock name="NVMCTRL" bit="6"/>
                <clock name="HSRAM" bit="7"/>
                <clock name="CMCC" bit="8"/>
                <clock name="DMAC" bit="9"/>
                <clock name="USB" bit="10"/>
                <clock name="BKUPRAM" bit="11"/>
                <clock name="PAC" bit="12"/>
                <clock name="QSPI" bit="13"/>
                <clock name="GMAC" bit="14"/>
                <clock name="SDHC0" bit="15"/>
                <clock name="SDHC1" bit="16"/>
                <clock name="CAN0" bit="17"/>
                <clock name="CAN1" bit="18"/>
                <clock name="ICM" bit="19"/>
                <clock name="PUKCC" bit="20"/>
                <clock name="QSPI_2X" bit="21"/>
                <clock name="NVMCTRL_SMEEPROM" bit="22"/>
                <clock name="NVMCTRL_CACHE" bit="23"/>
              </clock-group>
            </clock-groups>
          </instance>
        </module>
        <module name="NVMCTRL" id="U2409" version="1.0.0">
          <instance name="NVMCTRL">
            <register-group name="NVMCTRL" name-in-module="NVMCTRL" address-space="base" offset="0x41004000"/>
            <parameters>
              <param name="BLOCK_SIZE" value="8192" caption="Size Of Block (Bytes, Smallest Granularity for Erase Operation)"/>
              <param name="FLASH_SIZE" value="1048576"/>
              <param name="PAGES" value="2048"/>
              <param name="PAGES_PR_REGION" value="128"/>
              <!--  From Datasheet section "Electrical Characteristics","Flash Characteristics" table "Maximum operating Frequency" -->
              <param name="PSM_0_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
              <param name="PSM_0_FRMLP_FWS_0_MAX_FREQ" value="18000000"/>
              <param name="PSM_0_FRMLP_FWS_1_MAX_FREQ" value="36000000"/>
              <param name="PSM_0_FRMHS_FWS_0_MAX_FREQ" value="25000000"/>
              <param name="PSM_0_FRMHS_FWS_1_MAX_FREQ" value="50000000"/>
              <param name="PSM_1_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
              <param name="PSM_1_FRMLP_FWS_0_MAX_FREQ" value="8000000"/>
              <param name="PSM_1_FRMLP_FWS_1_MAX_FREQ" value="12000000"/>
              <param name="INSTANCE_ID" value="34" caption="Instance index for NVMCTRL"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="U2409" version="1.0.0">
          <instance name="FUSES">
            <register-group name="SW0_FUSES" name-in-module="SW0_FUSES" address-space="fuses" offset="0x00800080"/>
            <register-group name="USER_FUSES" name-in-module="USER_FUSES" address-space="fuses" offset="0x00804000"/>
          </instance>
        </module>
        <module name="OSCCTRL" id="U2401" version="1.0.0">
          <instance name="OSCCTRL">
            <register-group name="OSCCTRL" name-in-module="OSCCTRL" address-space="base" offset="0x40001000"/>
            <signals>
              <signal group="XIN" index="0" function="XIN0" pad="PA14"/>
              <signal group="XIN" index="1" function="XIN1" pad="PB22"/>
              <signal group="XOUT" index="0" function="XOUT0" pad="PA15"/>
              <signal group="XOUT" index="1" function="XOUT1" pad="PB23"/>
            </signals>
            <parameters>
              <param name="DFLLS_NUM" value="1" caption="Number of DFLLs"/>
              <param name="DFLL_IMPLEMENTED" value="1" caption="DFLL implemented"/>
              <param name="DFLL48M_BIASTESTPT_IMPLEMENTED" value="0" caption="DFLL48M bias test mode implemented"/>
              <param name="DFLL48M_CDACSTEPSIZE_SIZE" value="2" caption="Size COARSE DAC STEP"/>
              <param name="DFLL48M_COARSE_RESET_VALUE" value="32" caption="DFLL48M Frequency Coarse Reset Value (Before Calibration)"/>
              <param name="DFLL48M_COARSE_SIZE" value="6" caption="Size COARSE CALIBRATION"/>
              <param name="DFLL48M_ENABLE_RESET_VALUE" value="1" caption="Run oscillator at reset"/>
              <param name="DFLL48M_FDACSTEPSIZE_SIZE" value="2" caption="Size FINE DAC STEP"/>
              <param name="DFLL48M_FINE_RESET_VALUE" value="128" caption="DFLL48M Frequency Fine Reset Value (Before Calibration)"/>
              <param name="DFLL48M_FINE_SIZE" value="8" caption="Size FINE CALIBRATION"/>
              <param name="DFLL48M_ONDEMAND_RESET_VALUE" value="1" caption="Run oscillator always or only when requested"/>
              <param name="DFLL48M_RUNSTDBY_RESET_VALUE" value="0" caption="Run oscillator even if standby mode"/>
              <param name="DFLL48M_TCAL_SIZE" value="4" caption="Size TEMP CALIBRATION"/>
              <param name="DFLL48M_TCBIAS_SIZE" value="2" caption="Size TC BIAS CALIBRATION"/>
              <param name="DFLL48M_TESTPTSEL_SIZE" value="3" caption="Size TEST POINT SELECTOR"/>
              <param name="DFLL48M_WAITLOCK_ACTIVE" value="1" caption="Enable Wait Lock Feature"/>
              <param name="DPLLS_NUM" value="2" caption="Number of DPLLs"/>
              <param name="DPLL0_IMPLEMENTED" value="1" caption="DPLL0 implemented"/>
              <param name="DPLL0_I12ND_I12NDFRAC_PAD_CONTROL" value="0" caption="NOT_IMPLEMENTED: The ND and NDFRAC pad tests are not used, use registers instead"/>
              <param name="DPLL0_OCC_IMPLEMENTED" value="1" caption="DPLL0 OCC Implemented"/>
              <param name="DPLL1_IMPLEMENTED" value="1" caption="DPLL1 implemented"/>
              <param name="DPLL1_I12ND_I12NDFRAC_PAD_CONTROL" value="0" caption="NOT_IMPLEMENTED: The ND and NDFRAC pad tests are not used, use registers instead"/>
              <param name="DPLL1_OCC_IMPLEMENTED" value="0" caption="DPLL1 OCC Implemented"/>
              <param name="GCLK_ID_DFLL48" value="0" caption="Index of Generic Clock for DFLL48"/>
              <param name="GCLK_ID_FDPLL0" value="1" caption="Index of Generic Clock for DPLL0"/>
              <param name="GCLK_ID_FDPLL1" value="2" caption="Index of Generic Clock for DPLL1"/>
              <param name="GCLK_ID_FDPLL032K" value="3" caption="Index of Generic Clock for DPLL0 32K"/>
              <param name="GCLK_ID_FDPLL132K" value="3" caption="Index of Generic Clock for DPLL1 32K"/>
              <param name="OSC16M_IMPLEMENTED" value="0" caption="OSC16M implemented"/>
              <param name="OSC48M_IMPLEMENTED" value="0" caption="OSC48M implemented"/>
              <param name="OSC48M_NUM" value="1"/>
              <param name="RCOSCS_NUM" value="1" caption="Number of RCOSCs (min 1)"/>
              <param name="XOSCS_NUM" value="2" caption="Number of XOSCs"/>
              <param name="XOSC0_CFD_CLK_SELECT_SIZE" value="4" caption="Clock fail prescaler size"/>
              <param name="XOSC0_CFD_IMPLEMENTED" value="1" caption="Clock fail detected for xosc implemented"/>
              <param name="XOSC0_IMPLEMENTED" value="1" caption="XOSC0 implemented"/>
              <param name="XOSC0_ONDEMAND_RESET_VALUE" value="1" caption="Run oscillator always or only when requested"/>
              <param name="XOSC0_RUNSTDBY_RESET_VALUE" value="0" caption="Run oscillator even if standby mode"/>
              <param name="XOSC1_CFD_CLK_SELECT_SIZE" value="4" caption="Clock fail prescaler size"/>
              <param name="XOSC1_CFD_IMPLEMENTED" value="1" caption="Clock fail detected for xosc implemented"/>
              <param name="XOSC1_IMPLEMENTED" value="1" caption="XOSC1 implemented"/>
              <param name="XOSC1_ONDEMAND_RESET_VALUE" value="1" caption="Run oscillator always or only when requested"/>
              <param name="XOSC1_RUNSTDBY_RESET_VALUE" value="0" caption="Run oscillator even if standby mode"/>
              <param name="DFLL48M_VERSION" value="0x100"/>
              <param name="FDPLL_VERSION" value="0x100"/>
              <param name="XOSC_VERSION" value="0x100"/>
              <param name="INSTANCE_ID" value="4" caption="Instance index for OSCCTRL"/>
            </parameters>
          </instance>
        </module>
        <module name="OSC32KCTRL" id="U2400" version="1.0.0">
          <instance name="OSC32KCTRL">
            <register-group name="OSC32KCTRL" name-in-module="OSC32KCTRL" address-space="base" offset="0x40001400"/>
            <signals>
              <signal group="XIN32" function="XIN32" pad="PA00"/>
              <signal group="XOUT32" function="XOUT32" pad="PA01"/>
            </signals>
            <parameters>
              <param name="OSC32K_COARSE_CALIB_MSB" value="0" caption="OSC32K coarse calibration size"/>
              <param name="INSTANCE_ID" value="5" caption="Instance index for OSC32KCTRL"/>
            </parameters>
          </instance>
        </module>
        <module name="PAC" id="U2120" version="1.2.0">
          <instance name="PAC">
            <register-group name="PAC" name-in-module="PAC" address-space="base" offset="0x40000000"/>
            <parameters>
              <param name="HPB_NUM" value="4" caption="Number of bridges AHB/APB"/>
              <param name="INSTANCE_ID" value="0" caption="Instance index for PAC"/>
            </parameters>
          </instance>
        </module>
        <module name="PCC" id="U2017" version="1.1.0">
          <instance name="PCC">
            <register-group name="PCC" name-in-module="PCC" address-space="base" offset="0x43002C00"/>
            <signals>
              <signal group="CLK" function="K" pad="PA14"/>
              <signal group="DATA" index="0" function="K" pad="PA16"/>
              <signal group="DATA" index="1" function="K" pad="PA17"/>
              <signal group="DATA" index="2" function="K" pad="PA18"/>
              <signal group="DATA" index="3" function="K" pad="PA19"/>
              <signal group="DATA" index="4" function="K" pad="PA20"/>
              <signal group="DATA" index="5" function="K" pad="PA21"/>
              <signal group="DATA" index="6" function="K" pad="PA22"/>
              <signal group="DATA" index="7" function="K" pad="PA23"/>
              <signal group="DATA" index="8" function="K" pad="PB14"/>
              <signal group="DATA" index="9" function="K" pad="PB15"/>
              <signal group="DATA" index="10" function="K" pad="PC12"/>
              <signal group="DATA" index="11" function="K" pad="PC13"/>
              <signal group="DATA" index="12" function="K" pad="PC14"/>
              <signal group="DATA" index="13" function="K" pad="PC15"/>
              <signal group="DEN1" function="K" pad="PA12"/>
              <signal group="DEN2" function="K" pad="PA13"/>
            </signals>
            <parameters>
              <param name="DATA_SIZE" value="14"/>
              <param name="DMAC_ID_RX" value="80"/>
              <param name="INSTANCE_ID" value="107" caption="Instance index for PCC"/>
            </parameters>
          </instance>
        </module>
        <module name="PDEC" id="U2263" version="1.0.0">
          <instance name="PDEC">
            <register-group name="PDEC" name-in-module="PDEC" address-space="base" offset="0x42001C00"/>
            <signals>
              <signal group="QDI" index="0" function="G" pad="PB18" ioset="2"/>
              <signal group="QDI" index="0" function="G" pad="PB23" ioset="4"/>
              <signal group="QDI" index="0" function="G" pad="PC16" ioset="1"/>
              <signal group="QDI" index="0" function="G" pad="PA24" ioset="3"/>
              <signal group="QDI" index="1" function="G" pad="PB19" ioset="2"/>
              <signal group="QDI" index="1" function="G" pad="PB24" ioset="4"/>
              <signal group="QDI" index="1" function="G" pad="PC17" ioset="1"/>
              <signal group="QDI" index="1" function="G" pad="PA25" ioset="3"/>
              <signal group="QDI" index="2" function="G" pad="PB20" ioset="2"/>
              <signal group="QDI" index="2" function="G" pad="PB25" ioset="4"/>
              <signal group="QDI" index="2" function="G" pad="PC18" ioset="1"/>
              <signal group="QDI" index="2" function="G" pad="PB22" ioset="3"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare Channels units"/>
              <param name="GCLK_ID" value="31"/>
              <param name="INSTANCE_ID" value="71" caption="Instance index for PDEC"/>
            </parameters>
          </instance>
        </module>
